In [1]:
#Pandas Librabry- Pandas stands for panel data and is the core library panel data and is the core library for data manipulation
# and data analysis.
# -Its consist of single and multidimensional data for manipulation
# -Single Dimensional - Series Object
# -Multi Dimensional - Data Frame

In [3]:
#Series Object - Series Object is one dimensional labelled array
#first we have to import pandas 
#Always Remember one thing Series , S always in capital

In [7]:
import pandas as pd

In [12]:
s1=pd.Series([1,2,3,4,5])

In [13]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
type(s1)

pandas.core.series.Series

In [18]:
#if we have to change index

In [19]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
s1=pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])

s1

In [22]:
s1

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [23]:
#Series With Dictionary

In [25]:
s1=pd.Series({'a':1,'b':5,'c':6,'d':8})

In [27]:
s1

a    1
b    5
c    6
d    8
dtype: int64

In [28]:
#what if we change index

In [29]:
s1=pd.Series({'a':1,'b':5,'c':6,'d':8},index=['b','c','a','d'])

In [30]:
s1

b    5
c    6
a    1
d    8
dtype: int64

In [31]:
#Extracting a Single Element

In [32]:
s1

b    5
c    6
a    1
d    8
dtype: int64

In [34]:
s1=([1,2,3,4,5,6,])

In [35]:
s1[0]

1

In [36]:
s1[1]

2

In [37]:
s1[2]

3

In [38]:
s1[3]

4

In [39]:
#Extracting a Sequence

In [40]:
s1=pd.Series([1,2,3,4,5,6,7,8,9])

In [41]:
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [42]:
s1[2:]

2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [43]:
s1[3:6]

3    4
4    5
5    6
dtype: int64

In [44]:
#Extract element from Back

In [46]:
s1=pd.Series([1,2,3,4,5,6,7,89])

In [49]:
s1[-3:]

5     6
6     7
7    89
dtype: int64

In [50]:
#Adding two series

In [51]:
s1=pd.Series([1,2,3,4,5,6,7,8])

In [52]:
s2=pd.Series([8,7,6,5,4,3,2,1])

In [53]:
s1+s2

0    9
1    9
2    9
3    9
4    9
5    9
6    9
7    9
dtype: int64

In [55]:
#we can multiply / divide / and subtract also.
#see with example

In [56]:
s1=pd.Series([2,4,5,6])

In [57]:
s1*2

0     4
1     8
2    10
3    12
dtype: int64

In [58]:
#Lets Divide

In [59]:
s1

0    2
1    4
2    5
3    6
dtype: int64

In [60]:
s1/2

0    1.0
1    2.0
2    2.5
3    3.0
dtype: float64

In [61]:
#lets subtract

In [62]:
s1

0    2
1    4
2    5
3    6
dtype: int64

In [63]:
s1-1

0    1
1    3
2    4
3    5
dtype: int64

In [71]:
#Multi Dimensional data frame.
#Remember DataFrame Of D and F always in capital.

In [72]:
s1=pd.DataFrame({'Name':['Saurav','Vicky','Gaurav'],'Marks':[89,79,99]})

In [70]:
s1

     Name  Marks
0  Saurav     89
1   Vicky     79
2  Gaurav     99

In [73]:
#Data Frame inbuilt Function.
#load iris dataset.

In [74]:
iris=pd.read_csv("iris.csv")

In [75]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [78]:
#if you have to see top five rows.
#then use head() method

In [77]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [79]:
#if you want to see general information of dataset
#then you will try describe() method

In [80]:
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [84]:
#if we want to see last 5 rows.
#use tail()method

In [88]:
iris.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [89]:
#if we want to know the shape of dataset(number of rows and number columns)
#then you will use to shape() method

In [91]:
iris.shape

(150, 5)

In [92]:
#if we have to take separate row and column.
#we have to use iloc method

In [94]:
iris.iloc[5:11,0:3]

    sepal.length  sepal.width  petal.length
5            5.4          3.9           1.7
6            4.6          3.4           1.4
7            5.0          3.4           1.5
8            4.4          2.9           1.4
9            4.9          3.1           1.5
10           5.4          3.7           1.5

In [95]:
#if we have to separate by name we us eloc method.
# loc method
#lets see

In [99]:
iris.loc[0:3,("sepal.length","variety")]

   sepal.length variety
0           5.1  Setosa
1           4.9  Setosa
2           4.7  Setosa
3           4.6  Setosa

In [100]:
# if we have to drop a column we have to use axis=1, if we have to drop a row we use axis=0
#lets see how to use Drop method

In [103]:
iris.drop('sepal.length',axis=1)

     sepal.width  petal.length  petal.width    variety
0            3.5           1.4          0.2     Setosa
1            3.0           1.4          0.2     Setosa
2            3.2           1.3          0.2     Setosa
3            3.1           1.5          0.2     Setosa
4            3.6           1.4          0.2     Setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  Virginica
146          2.5           5.0          1.9  Virginica
147          3.0           5.2          2.0  Virginica
148          3.4           5.4          2.3  Virginica
149          3.0           5.1          1.8  Virginica

[150 rows x 4 columns]

In [104]:
#if we have to drop row by drop method
#lets se

In [105]:
iris.drop([0,1,2,3],axis=0)

     sepal.length  sepal.width  petal.length  petal.width    variety
4             5.0          3.6           1.4          0.2     Setosa
5             5.4          3.9           1.7          0.4     Setosa
6             4.6          3.4           1.4          0.3     Setosa
7             5.0          3.4           1.5          0.2     Setosa
8             4.4          2.9           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[146 rows x 5 columns]

In [107]:
#More Pandas Fuction 
#what  we can do if  we have to find mean, median, mode.
#lets seee
#start with mean

In [110]:
iris.mean()

C:\Users\saura\AppData\Local\Temp/ipykernel_14340/935066809.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.mean()

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

In [111]:
iris.median()

C:\Users\saura\AppData\Local\Temp/ipykernel_14340/1297003277.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.median()

sepal.length    5.80
sepal.width     3.00
petal.length    4.35
petal.width     1.30
dtype: float64

In [112]:
iris.mode()

   sepal.length  sepal.width  petal.length  petal.width     variety
0           5.0          3.0           1.4          0.2      Setosa
1           NaN          NaN           1.5          NaN  Versicolor
2           NaN          NaN           NaN          NaN   Virginica

In [113]:
#what if we hav to find maximum and minimum value

In [114]:
iris.min()

sepal.length       4.3
sepal.width        2.0
petal.length       1.0
petal.width        0.1
variety         Setosa
dtype: object

In [115]:
#lets se maximum

In [116]:
iris.max()

sepal.length          7.9
sepal.width           4.4
petal.length          6.9
petal.width           2.5
variety         Virginica
dtype: object

In [125]:
#if we hav to multiply any of the column data .
#we use this method

In [118]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [119]:
def dounle_make(s):
    return s*2

In [124]:
iris[['sepal.length','petal.length']].apply(dounle_make)

     sepal.length  petal.length
0            10.2           2.8
1             9.8           2.8
2             9.4           2.6
3             9.2           3.0
4            10.0           2.8
..            ...           ...
145          13.4          10.4
146          12.6          10.0
147          13.0          10.4
148          12.4          10.8
149          11.8          10.2

[150 rows x 2 columns]

In [126]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [137]:
def half(s):
    return s%2

In [138]:
iris[['sepal.length','petal.length']].apply(half)

     sepal.length  petal.length
0             1.1           1.4
1             0.9           1.4
2             0.7           1.3
3             0.6           1.5
4             1.0           1.4
..            ...           ...
145           0.7           1.2
146           0.3           1.0
147           0.5           1.2
148           0.2           1.4
149           1.9           1.1

[150 rows x 2 columns]

In [139]:
#if we have find categorical value. then we how to count the values.
#lets see

In [1]:
import pandas as pd

In [2]:
iris=pd.read_csv("iris.csv")

In [4]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [5]:
iris['variety'].value_counts()

Setosa        50
Versicolor    50
Virginica     50
Name: variety, dtype: int64

In [ ]:
#if we have to sort the value.in rows.
#lets se how its work.

In [7]:
iris.sort_values(by='petal.width')

     sepal.length  sepal.width  petal.length  petal.width    variety
32            5.2          4.1           1.5          0.1     Setosa
13            4.3          3.0           1.1          0.1     Setosa
37            4.9          3.6           1.4          0.1     Setosa
9             4.9          3.1           1.5          0.1     Setosa
12            4.8          3.0           1.4          0.1     Setosa
..            ...          ...           ...          ...        ...
140           6.7          3.1           5.6          2.4  Virginica
114           5.8          2.8           5.1          2.4  Virginica
100           6.3          3.3           6.0          2.5  Virginica
144           6.7          3.3           5.7          2.5  Virginica
109           7.2          3.6           6.1          2.5  Virginica

[150 rows x 5 columns]

In [ ]:
#Data Science Student
#Student of Datatrained-Saurav
#Basics of Pandas.